In [1]:
import pandas as pd

In [2]:
df1=pd.read_csv('movies.csv')
df1

,id,name,date,tagline,description,minute,rating
0,1000001,Barbie,2023.0,She's everything. He's just Ken.,Barbie and Ken are having the time of their li...,114.0,3.86
1,1000002,Parasite,2019.0,Act like you own the place.,"All unemployed, Ki-taek's family takes peculia...",133.0,4.56
2,1000003,Everything Everywhere All at Once,2022.0,The universe is so much bigger than you realize.,An aging Chinese immigrant is swept up in an i...,140.0,4.30
3,1000004,Fight Club,1999.0,Mischief. Mayhem. Soap.,A ticking-time-bomb insomniac and a slippery s...,139.0,4.27
4,1000005,La La Land,2016.0,Here's to the fools who dream.,"Mia, an aspiring actress, serves lattes to mov...",129.0,4.09
...,...,...,...,...,...,...,...
941592,1941593,神笛,NaN,NaN,NaN,NaN,NaN
941593,1941594,蟲極道蜜団子抗争編 壱ノ巻,NaN,NaN,Shinjuku forest at night. In the sap taverns o...,30.0,NaN
941594,1941595,蟲極道蜜団子抗争編 弐ノ巻,NaN,NaN,"The city that never sleeps, where insects gath...",30.0,NaN
941595,1941596,重生,NaN,NaN,"In a world where order has broken down, darkne...",NaN,NaN
941596,1941597,青ひげ公の城,NaN,NaN,NaN,130.0,NaN

In [3]:
df1.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 941597 entries, 0 to 941596
Data columns (total 7 columns):
 #   Column       Non-Null Count   Dtype
---  ------       --------------   -----
 0   id           941597 non-null  int64
 1   name         941587 non-null  object
 2   date         849684 non-null  float64
 3   tagline      139387 non-null  object
 4   description  780785 non-null  object
 5   minute       760027 non-null  float64
 6   rating       90999 non-null   float64
dtypes: float64(3), int64(1), object(3)
memory usage: 50.3+ MB

In [4]:
df2=pd.read_csv('actors.csv')
df2.head(10)

        id               name    role
0  1000001      Margot Robbie  Barbie
1  1000001       Ryan Gosling     Ken
2  1000001    America Ferrera  Gloria
3  1000001  Ariana Greenblatt   Sasha
4  1000001           Issa Rae  Barbie
5  1000001      Kate McKinnon  Barbie
6  1000001    Alexandra Shipp  Barbie
7  1000001        Emma Mackey  Barbie
8  1000001           Hari Nef  Barbie
9  1000001      Sharon Rooney  Barbie

In [5]:
df2.drop(columns='role',axis=1,inplace=True)
df2.head()

        id               name
0  1000001      Margot Robbie
1  1000001       Ryan Gosling
2  1000001    America Ferrera
3  1000001  Ariana Greenblatt
4  1000001           Issa Rae

In [6]:
df2.rename(columns={'name':'actor'},inplace=True)
df2.head()

        id              actor
0  1000001      Margot Robbie
1  1000001       Ryan Gosling
2  1000001    America Ferrera
3  1000001  Ariana Greenblatt
4  1000001           Issa Rae

In [7]:
df2=df2.groupby('id').head(5)
df2.tail()

              id           actor
5798444  1941596  Sandrine Pinna
5798445  1941596         Marc Ma
5798446  1941596             线雨轩
5798448  1941597  Hiroshi Mikami
5798449  1941597   Keiko Oginome

In [8]:
df2=df2.groupby('id')['actor'].apply(lambda x: ', '.join(x.astype(str))).reset_index()
df2.head(10)

        id                                              actor
0  1000001  Margot Robbie, Ryan Gosling, America Ferrera, ...
1  1000002  Song Kang-ho, Lee Sun-kyun, Cho Yeo-jeong, Cho...
2  1000003  Michelle Yeoh, Ke Huy Quan, Stephanie Hsu, Jam...
3  1000004  Edward Norton, Brad Pitt, Helena Bonham Carter...
4  1000005  Ryan Gosling, Emma Stone, John Legend, Rosemar...
5  1000006  Cillian Murphy, Emily Blunt, Matt Damon, Rober...
6  1000007  Matthew McConaughey, Anne Hathaway, Michael Ca...
7  1000008  Joaquin Phoenix, Robert De Niro, Zazie Beetz, ...
8  1000009  Timothée Chalamet, Rebecca Ferguson, Oscar Isa...
9  1000010  John Travolta, Samuel L. Jackson, Uma Thurman,...

In [9]:
df2.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 634302 entries, 0 to 634301
Data columns (total 2 columns):
 #   Column  Non-Null Count   Dtype
---  ------  --------------   -----
 0   id      634302 non-null  int64
 1   actor   634302 non-null  object
dtypes: int64(1), object(1)
memory usage: 9.7+ MB

In [10]:
df2.tail(5)

             id                                              actor
634297  1941559                                                 黑灯
634298  1941563  Kara Wai Ying-Hung, Zhang Youhao, Pan Binlong,...
634299  1941589                                                王军锋
634300  1941596  Nick Cheung, Ethan Juan, Sandrine Pinna, Marc ...
634301  1941597                      Hiroshi Mikami, Keiko Oginome

In [11]:
merged_df= pd.merge(df1,df2,on='id',how='left')
merged_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 941597 entries, 0 to 941596
Data columns (total 8 columns):
 #   Column       Non-Null Count   Dtype
---  ------       --------------   -----
 0   id           941597 non-null  int64
 1   name         941587 non-null  object
 2   date         849684 non-null  float64
 3   tagline      139387 non-null  object
 4   description  780785 non-null  object
 5   minute       760027 non-null  float64
 6   rating       90999 non-null   float64
 7   actor        634302 non-null  object
dtypes: float64(3), int64(1), object(4)
memory usage: 57.5+ MB

In [12]:
df3=pd.read_csv('crew.csv')
df3.head()

        id      role            name
0  1000001  Director    Greta Gerwig
1  1000001  Producer    Tom Ackerley
2  1000001  Producer   Margot Robbie
3  1000001  Producer  Robbie Brenner
4  1000001  Producer    David Heyman

In [13]:
df3=df3[df3['role'].isin(['Director'])]
df3.info()

<class 'pandas.core.frame.DataFrame'>
Index: 900753 entries, 0 to 4720173
Data columns (total 3 columns):
 #   Column  Non-Null Count   Dtype
---  ------  --------------   -----
 0   id      900753 non-null  int64
 1   role    900753 non-null  object
 2   name    900753 non-null  object
dtypes: int64(1), object(2)
memory usage: 27.5+ MB

In [14]:
df3.head()

          id      role              name
0    1000001  Director      Greta Gerwig
141  1000002  Director      Bong Joon-ho
212  1000003  Director  Daniel Scheinert
213  1000003  Director       Daniel Kwan
299  1000004  Director     David Fincher

In [15]:
df3=df3.groupby(['id', 'role'])['name'].apply(lambda x: ', '.join(x)).unstack(fill_value='').reset_index()
df3.head()

role       id                       Director
0     1000001                   Greta Gerwig
1     1000002                   Bong Joon-ho
2     1000003  Daniel Scheinert, Daniel Kwan
3     1000004                  David Fincher
4     1000005                Damien Chazelle

In [16]:
merged_df=pd.merge(merged_df,df3,on='id',how='left')
merged_df.head()

,id,name,date,tagline,description,minute,rating,actor,Director
0,1000001,Barbie,2023.0,She's everything. He's just Ken.,Barbie and Ken are having the time of their li...,114.0,3.86,"Margot Robbie, Ryan Gosling, America Ferrera, ...",Greta Gerwig
1,1000002,Parasite,2019.0,Act like you own the place.,"All unemployed, Ki-taek's family takes peculia...",133.0,4.56,"Song Kang-ho, Lee Sun-kyun, Cho Yeo-jeong, Cho...",Bong Joon-ho
2,1000003,Everything Everywhere All at Once,2022.0,The universe is so much bigger than you realize.,An aging Chinese immigrant is swept up in an i...,140.0,4.30,"Michelle Yeoh, Ke Huy Quan, Stephanie Hsu, Jam...","Daniel Scheinert, Daniel Kwan"
3,1000004,Fight Club,1999.0,Mischief. Mayhem. Soap.,A ticking-time-bomb insomniac and a slippery s...,139.0,4.27,"Edward Norton, Brad Pitt, Helena Bonham Carter...",David Fincher
4,1000005,La La Land,2016.0,Here's to the fools who dream.,"Mia, an aspiring actress, serves lattes to mov...",129.0,4.09,"Ryan Gosling, Emma Stone, John Legend, Rosemar...",Damien Chazelle

In [17]:
merged_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 941597 entries, 0 to 941596
Data columns (total 9 columns):
 #   Column       Non-Null Count   Dtype
---  ------       --------------   -----
 0   id           941597 non-null  int64
 1   name         941587 non-null  object
 2   date         849684 non-null  float64
 3   tagline      139387 non-null  object
 4   description  780785 non-null  object
 5   minute       760027 non-null  float64
 6   rating       90999 non-null   float64
 7   actor        634302 non-null  object
 8   Director     793522 non-null  object
dtypes: float64(3), int64(1), object(5)
memory usage: 64.7+ MB

In [18]:
df4=pd.read_csv('genres.csv')
df4

              id      genre
0        1000001     Comedy
1        1000001  Adventure
2        1000002     Comedy
3        1000002   Thriller
4        1000002      Drama
...          ...        ...
1046844  1941563      Drama
1046845  1941566      Crime
1046846  1941569      Crime
1046847  1941596     Action
1046848  1941596      Crime

[1046849 rows x 2 columns]

In [19]:
df4=df4.groupby('id')['genre'].apply(lambda x: ', '.join(x)).reset_index()
df4.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 676491 entries, 0 to 676490
Data columns (total 2 columns):
 #   Column  Non-Null Count   Dtype
---  ------  --------------   -----
 0   id      676491 non-null  int64
 1   genre   676491 non-null  object
dtypes: int64(1), object(1)
memory usage: 10.3+ MB

In [20]:
merged_df=pd.merge(merged_df,df4,on='id',how='left')
merged_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 941597 entries, 0 to 941596
Data columns (total 10 columns):
 #   Column       Non-Null Count   Dtype
---  ------       --------------   -----
 0   id           941597 non-null  int64
 1   name         941587 non-null  object
 2   date         849684 non-null  float64
 3   tagline      139387 non-null  object
 4   description  780785 non-null  object
 5   minute       760027 non-null  float64
 6   rating       90999 non-null   float64
 7   actor        634302 non-null  object
 8   Director     793522 non-null  object
 9   genre        676491 non-null  object
dtypes: float64(3), int64(1), object(6)
memory usage: 71.8+ MB

In [21]:
df5=pd.read_csv('languages.csv')
df5.drop(columns='type',inplace=True,axis=1)
df5.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1038762 entries, 0 to 1038761
Data columns (total 2 columns):
 #   Column    Non-Null Count    Dtype
---  ------    --------------    -----
 0   id        1038762 non-null  int64
 1   language  1038762 non-null  object
dtypes: int64(1), object(1)
memory usage: 15.9+ MB

In [22]:
df5=df5.groupby('id')['language'].apply(lambda x: ', '.join(x)).reset_index()
df5.head()

        id                              language
0  1000001                               English
1  1000002       Korean, English, German, Korean
2  1000003  English, Cantonese, Chinese, English
3  1000004                               English
4  1000005                               English

In [23]:
df5.tail()

             id  language
905573  1941593   Chinese
905574  1941594   English
905575  1941595   English
905576  1941596   Chinese
905577  1941597  Japanese

In [24]:
merged_df=pd.merge(merged_df,df5,on='id',how='left')
merged_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 941597 entries, 0 to 941596
Data columns (total 11 columns):
 #   Column       Non-Null Count   Dtype
---  ------       --------------   -----
 0   id           941597 non-null  int64
 1   name         941587 non-null  object
 2   date         849684 non-null  float64
 3   tagline      139387 non-null  object
 4   description  780785 non-null  object
 5   minute       760027 non-null  float64
 6   rating       90999 non-null   float64
 7   actor        634302 non-null  object
 8   Director     793522 non-null  object
 9   genre        676491 non-null  object
 10  language     905578 non-null  object
dtypes: float64(3), int64(1), object(7)
memory usage: 79.0+ MB

In [25]:
df6=pd.read_csv('posters.csv')
df6.head()

        id                                               link
0  1000001  https://a.ltrbxd.com/resized/film-poster/2/7/7...
1  1000002  https://a.ltrbxd.com/resized/film-poster/4/2/6...
2  1000003  https://a.ltrbxd.com/resized/film-poster/4/7/4...
3  1000004  https://a.ltrbxd.com/resized/film-poster/5/1/5...
4  1000005  https://a.ltrbxd.com/resized/film-poster/2/4/0...

In [26]:
merged_df=pd.merge(merged_df,df6,on='id',how='left')
merged_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 941597 entries, 0 to 941596
Data columns (total 12 columns):
 #   Column       Non-Null Count   Dtype
---  ------       --------------   -----
 0   id           941597 non-null  int64
 1   name         941587 non-null  object
 2   date         849684 non-null  float64
 3   tagline      139387 non-null  object
 4   description  780785 non-null  object
 5   minute       760027 non-null  float64
 6   rating       90999 non-null   float64
 7   actor        634302 non-null  object
 8   Director     793522 non-null  object
 9   genre        676491 non-null  object
 10  language     905578 non-null  object
 11  link         760885 non-null  object
dtypes: float64(3), int64(1), object(8)
memory usage: 86.2+ MB

In [27]:
df7=pd.read_csv('themes.csv')
df7=df7.groupby('id')['theme'].apply(lambda x: '.'.join(x)).reset_index()
df7.tail()

            id                                              theme
24503  1762425     Song and dance.Erotic relationships and desire
24504  1819348  Intense violence and sexual transgression.Twis...
24505  1826155  Horror, the undead and monster classics.Surviv...
24506  1835643  Crime, drugs and gangsters.Suspenseful crime t...
24507  1849827  Faith and religion.Faith and spiritual journey...

In [28]:
df7.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 24508 entries, 0 to 24507
Data columns (total 2 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   id      24508 non-null  int64
 1   theme   24508 non-null  object
dtypes: int64(1), object(1)
memory usage: 383.1+ KB

In [29]:
merged_df=pd.merge(merged_df,df7,on='id',how='left')
merged_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 941597 entries, 0 to 941596
Data columns (total 13 columns):
 #   Column       Non-Null Count   Dtype
---  ------       --------------   -----
 0   id           941597 non-null  int64
 1   name         941587 non-null  object
 2   date         849684 non-null  float64
 3   tagline      139387 non-null  object
 4   description  780785 non-null  object
 5   minute       760027 non-null  float64
 6   rating       90999 non-null   float64
 7   actor        634302 non-null  object
 8   Director     793522 non-null  object
 9   genre        676491 non-null  object
 10  language     905578 non-null  object
 11  link         760885 non-null  object
 12  theme        24508 non-null   object
dtypes: float64(3), int64(1), object(9)
memory usage: 93.4+ MB

In [30]:
merged_df.rename(columns={
    'Director':'director',
    'link':'poster'
}, inplace=True)
merged_df

,id,name,date,tagline,description,minute,rating,actor,director,genre,language,poster,theme
0,1000001,Barbie,2023.0,She's everything. He's just Ken.,Barbie and Ken are having the time of their li...,114.0,3.86,"Margot Robbie, Ryan Gosling, America Ferrera, ...",Greta Gerwig,"Comedy, Adventure",English,https://a.ltrbxd.com/resized/film-poster/2/7/7...,Humanity and the world around us.Crude humor a...
1,1000002,Parasite,2019.0,Act like you own the place.,"All unemployed, Ki-taek's family takes peculia...",133.0,4.56,"Song Kang-ho, Lee Sun-kyun, Cho Yeo-jeong, Cho...",Bong Joon-ho,"Comedy, Thriller, Drama","Korean, English, German, Korean",https://a.ltrbxd.com/resized/film-poster/4/2/6...,Humanity and the world around us.Intense viole...
2,1000003,Everything Everywhere All at Once,2022.0,The universe is so much bigger than you realize.,An aging Chinese immigrant is swept up in an i...,140.0,4.30,"Michelle Yeoh, Ke Huy Quan, Stephanie Hsu, Jam...","Daniel Scheinert, Daniel Kwan","Science Fiction, Adventure, Comedy, Action","English, Cantonese, Chinese, English",https://a.ltrbxd.com/resized/film-poster/4/7/4...,Humanity and the world around us.Moving relati...
3,1000004,Fight Club,1999.0,Mischief. Mayhem. Soap.,A ticking-time-bomb insomniac and a slippery s...,139.0,4.27,"Edward Norton, Brad Pitt, Helena Bonham Carter...",David Fincher,Drama,English,https://a.ltrbxd.com/resized/film-poster/5/1/5...,Intense violence and sexual transgression.Huma...
4,1000005,La La Land,2016.0,Here's to the fools who dream.,"Mia, an aspiring actress, serves lattes to mov...",129.0,4.09,"Ryan Gosling, Emma Stone, John Legend, Rosemar...",Damien Chazelle,"Drama, Comedy, Music, Romance",English,https://a.ltrbxd.com/resized/film-poster/2/4/0...,Song and dance.Humanity and the world around u...
...,...,...,...,...,...,...,...,...,...,...,...,...,...
941592,1941593,神笛,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,Chinese,NaN,NaN
941593,1941594,蟲極道蜜団子抗争編 壱ノ巻,NaN,NaN,Shinjuku forest at night. In the sap taverns o...,30.0,NaN,NaN,NaN,NaN,English,NaN,NaN
941594,1941595,蟲極道蜜団子抗争編 弐ノ巻,NaN,NaN,"The city that never sleeps, where insects gath...",30.0,NaN,NaN,NaN,NaN,English,https://a.ltrbxd.com/resized/film-poster/1/1/8...,NaN
941595,1941596,重生,NaN,NaN,"In a world where order has broken down, darkne...",NaN,NaN,"Nick Cheung, Ethan Juan, Sandrine Pinna, Marc ...",Marc Ma,"Action, Crime",Chinese,https://a.ltrbxd.com/resized/film-poster/1/1/8...,NaN
941596,1941597,青ひげ公の城,NaN,NaN,NaN,130.0,NaN,"Hiroshi Mikami, Keiko Oginome",NaN,NaN,Japanese,NaN,NaN

In [31]:
aggregated_movies=merged_df.head(36667)
aggregated_movies.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 36667 entries, 0 to 36666
Data columns (total 13 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   id           36667 non-null  int64
 1   name         36667 non-null  object
 2   date         36518 non-null  float64
 3   tagline      21731 non-null  object
 4   description  36638 non-null  object
 5   minute       36417 non-null  float64
 6   rating       36369 non-null  float64
 7   actor        35808 non-null  object
 8   director     36530 non-null  object
 9   genre        36498 non-null  object
 10  language     35685 non-null  object
 11  poster       36656 non-null  object
 12  theme        19202 non-null  object
dtypes: float64(3), int64(1), object(9)
memory usage: 3.6+ MB

In [32]:
aggregated_movies.to_csv('aggregated_movies.csv',index=False)